import List from '@/components/ui/list';
import Typography from '@/components/ui/typography';
import Link from 'next/link';

export default function PrivacyPage() {
  return (
    <section className='mx-10'>
      <Typography variant='h1'>Політика Конфіденційності</Typography>
      <Typography variant='p'>Останнє оновлення: 18 лютого 2024</Typography>
      <Typography variant='p'>
        Ця Політика Конфіденційності описує наші правила та процедури щодо
        збору, використання та розкриття Вашої інформації під час використання
        Сервісу та повідомляє Вам про Ваші права на конфіденційність і як закон
        захищає Вас.
      </Typography>
      <Typography variant='p'>
        Ми використовуємо Ваші Персональні дані для надання та покращення
        Сервісу. Використовуючи Сервіс, Ви погоджуєтесь на збір та використання
        інформації відповідно до цієї Політики Конфіденційності.
      </Typography>
      <Typography variant='h2'>Тлумачення та Визначення</Typography>
      <Typography variant='h3'>Тлумачення</Typography>
      <Typography variant='p'>
        Слова, перша літера яких написана з великої літери, мають значення,
        визначені за наступних умов. Наступні визначення матимуть однакове
        значення незалежно від того, чи з&quot;являються вони в однині чи в множині.
      </Typography>
      <Typography variant='h3'>Визначення</Typography>
      <Typography variant='p'>
        Для цілей цієї Політики Конфіденційності:
      </Typography>
      <List>
        <li>
          <Typography variant='p'>
            <strong>Обліковий запис</strong> означає унікальний обліковий запис,
            створений для Вас для доступу до нашого Сервісу або його частин.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Афілійована особа</strong> означає суб&quot;єкт, який контролює,
            контролюється або перебуває під спільним контролем із стороною, де
            &quot;контроль&quot; означає володіння 50% або більше акцій, частки
            власності або інших цінних паперів, що дають право голосувати за
            вибори директорів або іншого керівного органу.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Компанія</strong> (яка в цій Угоді називається або
            &quot;Компанія&quot;, &quot;Ми&quot;, &quot;Нас&quot; або
            &quot;Наш&quot;) стосується ProgressHub.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Файли cookie</strong> - це маленькі файли, які розміщуються
            на Вашому комп&quot;ютері, мобільному пристрої або будь-якому іншому
            пристрої веб-сайтом і містять деталі Вашої історії перегляду на
            цьому веб-сайті серед багатьох інших використань.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Країна</strong> стосується: Україна
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Пристрій</strong> означає будь-який пристрій, який може
            отримати доступ до Сервісу, такий як комп&quot;ютер, мобільний телефон
            або цифровий планшет.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Персональні дані</strong> - це будь-яка інформація, яка
            стосується ідентифікованої або особи, яку можна ідентифікувати.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Сервіс</strong> стосується Веб-сайту.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Постачальник послуг</strong> означає будь-яку фізичну або
            юридичну особу, яка обробляє дані від імені Компанії. Це стосується
            сторонніх компаній або осіб, найнятих Компанією для сприяння
            Сервісу, надання Сервісу від імені Компанії, виконання послуг,
            пов&quot;язаних із Сервісом, або допомоги Компанії в аналізі того, як
            Сервіс використовується.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Сервіс соціальних медіа третьої сторони</strong> стосується
            будь-якого веб-сайту або будь-якого веб-сайту соціальної мережі,
            через який Користувач може увійти або створити обліковий запис для
            використання Сервісу.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Дані використання</strong> стосуються даних, які збираються
            автоматично, які генеруються використанням Сервісу або з самої
            інфраструктури Сервісу (наприклад, тривалість відвідування
            сторінки).
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Веб-сайт</strong> стосується ProgressHub, доступного за
            адресою{' '}
            <Link
              href='https://progresshub.vercel.app/'
              rel='external nofollow noopener'
              target='_blank'
            >
              https://progresshub.vercel.app/
            </Link>
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Ви</strong> означає фізичну особу, яка отримує доступ або
            використовує Сервіс, або компанію, або іншу юридичну особу, від
            імені якої така фізична особа отримує доступ або використовує
            Сервіс, залежно від обставин.
          </Typography>
        </li>
      </List>
      <Typography variant='h2'>
        Збір та Використання Ваших Персональних Даних
      </Typography>
      <Typography variant='h3'>Типи Даних, Які Збираються</Typography>
      <Typography variant='h4'>Персональні Дані</Typography>
      <Typography variant='p'>
        Під час використання Нашого Сервісу Ми можемо попросити Вас надати Нам
        певну особисту інформацію, яка може бути використана для зв&quot;язку з Вами
        або Вашої ідентифікації. Особиста інформація може включати, але не
        обмежується:
      </Typography>
      <List>
        <li>
          <Typography variant='p'>Адреса електронної пошти</Typography>
        </li>
        <li>
          <Typography variant='p'>Ім&quot;я та прізвище</Typography>
        </li>
        <li>
          <Typography variant='p'>Дані використання</Typography>
        </li>
      </List>
      <Typography variant='h4'>Дані Використання</Typography>
      <Typography variant='p'>
        Дані використання збираються автоматично при використанні Сервісу.
      </Typography>
      <Typography variant='p'>
        Дані використання можуть включати таку інформацію, як адреса
        Інтернет-протоколу Вашого Пристрою (наприклад, IP-адреса), тип браузера,
        версія браузера, сторінки нашого Сервісу, які Ви відвідуєте, час і дата
        Вашого відвідування, час, проведений на цих сторінках, унікальні
        ідентифікатори пристрою та інші діагностичні дані.
      </Typography>
      <Typography variant='p'>
        Коли Ви отримуєте доступ до Сервісу через мобільний пристрій, Ми можемо
        автоматично збирати певну інформацію, включаючи, але не обмежуючись, тип
        мобільного пристрою, який Ви використовуєте, унікальний ідентифікатор
        Вашого мобільного пристрою, IP-адресу Вашого мобільного пристрою, Вашу
        мобільну операційну систему, тип мобільного Інтернет-браузера, який Ви
        використовуєте, унікальні ідентифікатори пристрою та інші діагностичні
        дані.
      </Typography>
      <Typography variant='p'>
        Ми також можемо збирати інформацію, яку Ваш браузер надсилає щоразу,
        коли Ви відвідуєте наш Сервіс або коли Ви отримуєте доступ до Сервісу
        через мобільний пристрій.
      </Typography>
      <Typography variant='h4'>
        Інформація з Сервісів Соціальних Медіа Третіх Сторін
      </Typography>
      <Typography variant='p'>
        Компанія дозволяє Вам створити обліковий запис і увійти для використання
        Сервісу через наступні Сервіси Соціальних Медіа Третіх Сторін:
      </Typography>
      <List>
        <li>Google</li>
        <li>GitHub</li>
      </List>
      <Typography variant='p'>
        Якщо Ви вирішите зареєструватися через або іншим чином надати нам доступ
        до Сервісу Соціальних Медіа Третьої Сторони, Ми можемо збирати
        Персональні дані, які вже пов&quot;язані з обліковим записом Вашого Сервісу
        Соціальних Медіа Третьої Сторони, такі як Ваше ім&quot;я, Ваша електронна
        адреса, Ваша діяльність або Ваш список контактів, пов&quot;язаний з цим
        обліковим записом.
      </Typography>
      <Typography variant='p'>
        Ви також можете мати можливість поділитися додатковою інформацією з
        Компанією через обліковий запис Вашого Сервісу Соціальних Медіа Третьої
        Сторони. Якщо Ви вирішите надати таку інформацію та Персональні дані під
        час реєстрації або іншим чином, Ви даєте Компанії дозвіл
        використовувати, ділитися та зберігати їх у спосіб, відповідний до цієї
        Політики Конфіденційності.
      </Typography>
      <Typography variant='h4'>
        Технології Відстеження та Файли Cookie
      </Typography>
      <Typography variant='p'>
        Ми використовуємо Файли cookie та подібні технології відстеження для
        відстеження активності на Нашому Сервісі та зберігання певної
        інформації. Використовуються такі технології відстеження, як маяки, теги
        та скрипти для збору та відстеження інформації, а також для покращення
        та аналізу Нашого Сервісу. Технології, які ми використовуємо, можуть
        включати:
      </Typography>
      <List>
        <li>
          <strong>Файли cookie або Браузерні файли cookie.</strong> Файл cookie
          - це маленький файл, розміщений на Вашому Пристрої. Ви можете вказати
          своєму браузеру відмовитися від усіх Файлів cookie або вказати, коли
          Файл cookie відправляється. Однак, якщо Ви не приймаєте Файли cookie,
          Ви можете не мати можливості використовувати деякі частини нашого
          Сервісу. Якщо Ви не налаштували свій браузер так, щоб він відмовлявся
          від Файлів cookie, наш Сервіс може використовувати Файли cookie.
        </li>
        <li>
          <strong>Веб-маяки.</strong> Певні розділи нашого Сервісу та наших
          електронних листів можуть містити маленькі електронні файли, відомі як
          веб-маяки (також відомі як прозорі гіфи, піксельні теги та
          однопіксельні гіфи), які дозволяють Компанії, наприклад, підраховувати
          користувачів, які відвідали ці сторінки або відкрили електронний лист,
          та для інших пов&quot;язаних статистик веб-сайту (наприклад, запис
          популярності певного розділу та перевірка цілісності системи та
          сервера).
        </li>
      </List>
      <Typography variant='p'>
        Файли cookie можуть бути &quot;Постійними&quot; або
        &quot;Сесійними&quot; Файлами cookie. Постійні Файли cookie залишаються
        на Вашому персональному комп&quot;ютері або мобільному пристрої, коли Ви
        відключаєтесь від Інтернету, тоді як Сесійні Файли cookie видаляються,
        як тільки Ви закриваєте свій веб-браузер. Ви можете дізнатися більше про
        файли cookie на{' '}
        <Link
          href='https://www.termsfeed.com/blog/cookies/#What_Are_Cookies'
          target='_blank'
        >
          веб-сайті TermsFeed
        </Link>{' '}
        статті.
      </Typography>
      <Typography variant='p'>
        Ми використовуємо як Сесійні, так і Постійні Файли cookie для цілей,
        викладених нижче:
      </Typography>
      <List>
        <li>
          <Typography variant='p'>
            <strong>Необхідні / Істотні Файли cookie</strong>
          </Typography>
          <Typography variant='p'>Тип: Сесійні Файли cookie</Typography>
          <Typography variant='p'>Адміністровані: Нами</Typography>
          <Typography variant='p'>
            Мета: Ці Файли cookie необхідні для надання Вам послуг, доступних
            через Веб-сайт, і для того, щоб Ви могли використовувати деякі його
            функції. Вони допомагають аутентифікувати користувачів і запобігти
            шахрайському використанню облікових записів користувачів. Без цих
            Файлів cookie послуги, які Ви запитали, не можуть бути надані, і ми
            використовуємо ці Файли cookie лише для того, щоб надати Вам ці
            послуги.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>
              Файли cookie Політики / Прийняття Повідомлення про Файли cookie
            </strong>
          </Typography>
          <Typography variant='p'>Тип: Постійні Файли cookie</Typography>
          <Typography variant='p'>Адміністровані: Нами</Typography>
          <Typography variant='p'>
            Мета: Ці Файли cookie визначають, чи користувачі прийняли
            використання файлів cookie на Веб-сайті.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Функціональні Файли cookie</strong>
          </Typography>
          <Typography variant='p'>Тип: Постійні Файли cookie</Typography>
          <Typography variant='p'>Адміністровані: Нами</Typography>
          <Typography variant='p'>
            Мета: Ці Файли cookie дозволяють нам запам&quot;ятовувати вибір, який Ви
            робите при використанні Веб-сайту, наприклад, запам&quot;ятовування Ваших
            даних для входу або мовних уподобань. Метою цих Файлів cookie є
            надання Вам більш особистого досвіду та уникнення того, щоб Вам
            доводилося знову вводити свої уподобання кожного разу, коли Ви
            використовуєте Веб-сайт.
          </Typography>
        </li>
      </List>
      <Typography variant='p'>
        Для отримання додаткової інформації про файли cookie, які ми
        використовуємо, та Ваш вибір щодо файлів cookie, будь ласка, відвідайте
        нашу Політику щодо Файлів cookie або розділ Файлів cookie нашої Політики
        Конфіденційності.
      </Typography>
      <Typography variant='h3'>
        Використання Ваших Персональних Даних
      </Typography>
      <Typography variant='p'>
        Компанія може використовувати Персональні Дані для таких цілей:
      </Typography>
      <List>
        <li>
          <Typography variant='p'>
            <strong>Для надання та підтримки нашого Сервісу</strong>, включаючи
            моніторинг використання нашого Сервісу.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для управління Вашим Обліковим записом:</strong> для
            управління Вашою реєстрацією як користувача Сервісу. Персональні
            Дані, які Ви надаєте, можуть дати Вам доступ до різних
            функціональних можливостей Сервісу, які доступні Вам як
            зареєстрованому користувачу.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для виконання контракту:</strong> розробка, дотримання та
            здійснення контракту на купівлю продуктів, товарів або послуг, які
            Ви придбали, або будь-якого іншого контракту з Нами через Сервіс.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для зв&quot;язку з Вами:</strong> Для зв&quot;язку з Вами електронною
            поштою, телефонними дзвінками, SMS або іншими еквівалентними формами
            електронного зв&quot;язку, такими як push-повідомлення мобільного додатку
            щодо оновлень або інформаційних повідомлень, пов&quot;язаних з
            функціональними можливостями, продуктами або контрактними послугами,
            включаючи оновлення безпеки, коли це необхідно або доцільно для їх
            впровадження.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Щоб надати Вам</strong> новини, спеціальні пропозиції та
            загальну інформацію про інші товари, послуги та події, які ми
            пропонуємо, які подібні до тих, що Ви вже придбали або про які
            запитували, якщо Ви не відмовилися від отримання такої інформації.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для управління Вашими запитами:</strong> Для обслуговування
            та управління Вашими запитами до Нас.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для бізнес-передач:</strong> Ми можемо використовувати Вашу
            інформацію для оцінки або проведення злиття, відчуження,
            реструктуризації, реорганізації, розпуску або іншого продажу чи
            передачі деяких або всіх Наших активів, чи то як діючого
            підприємства, чи то як частини банкрутства, ліквідації або подібного
            провадження, в якому Персональні Дані, що зберігаються Нами про
            користувачів нашого Сервісу, є серед переданих активів.
          </Typography>
        </li>
        <li>
          <Typography variant='p'>
            <strong>Для інших цілей</strong>: Ми можемо використовувати Вашу
            інформацію для інших цілей, таких як аналіз даних, виявлення
            тенденцій використання, визначення ефективності наших рекламних
            кампаній та для оцінки та покращення нашого Сервісу, продуктів,
            послуг, маркетингу та Вашого досвіду.
          </Typography>
        </li>
      </List>
      <Typography variant='p'>
        Ми можемо ділитися Вашою особистою інформацією в наступних ситуаціях:
      </Typography>
      <List>
        <li>
          <strong>З Постачальниками послуг:</strong> Ми можемо ділитися Вашою
          особистою інформацією з Постачальниками послуг для моніторингу та
          аналізу використання нашого Сервісу, для зв&quot;язку з Вами.
        </li>
        <li>
          <strong>Для бізнес-передач:</strong> Ми можемо ділитися або передавати
          Вашу особисту інформацію у зв&quot;язку з, або під час переговорів про,
          будь-яке злиття, продаж активів Компанії, фінансування або придбання
          всього або частини Нашого бізнесу іншою компанією.
        </li>
        <li>
          <strong>З Афілійованими особами:</strong> Ми можемо ділитися Вашою
          інформацією з Нашими афілійованими особами, і в такому випадку ми
          вимагатимемо від цих афілійованих осіб дотримуватися цієї Політики
          Конфіденційності. Афілійовані особи включають Нашу материнську
          компанію та будь-які інші дочірні компанії, партнерів спільного
          підприємства або інші компанії, які Ми контролюємо або які перебувають
          під спільним контролем з Нами.
        </li>
        <li>
          <strong>З бізнес-партнерами:</strong> Ми можемо ділитися Вашою
          інформацією з Нашими бізнес-партнерами, щоб запропонувати Вам певні
          продукти, послуги або рекламні акції.
        </li>
        <li>
          <strong>З іншими користувачами:</strong> коли Ви ділитеся особистою
          інформацією або іншим чином взаємодієте в публічних областях з іншими
          користувачами, таку інформацію можуть бачити всі користувачі, і вона
          може бути публічно поширена за межами сайту. Якщо Ви взаємодієте з
          іншими користувачами або реєструєтеся через Сервіс Соціальних Медіа
          Третьої Сторони, Ваші контакти в Сервісі Соціальних Медіа Третьої
          Сторони можуть бачити Ваше ім&quot;я, профіль, зображення та опис Вашої
          діяльності. Так само, інші користувачі зможуть переглядати опис Вашої
          діяльності, спілкуватися з Вами та переглядати Ваш профіль.
        </li>
        <li>
          <strong>За Вашою згодою</strong>: Ми можемо розкривати Вашу особисту
          інформацію для будь-якої іншої мети з Вашої згоди.
        </li>
      </List>
      <Typography variant='h3'>Зберігання Ваших Персональних Даних</Typography>
      <Typography variant='p'>
        Компанія зберігатиме Ваші Персональні Дані лише стільки, скільки
        необхідно для цілей, викладених у цій Політиці Конфіденційності. Ми
        зберігатимемо та використовуватимемо Ваші Персональні Дані в тій мірі,
        яка необхідна для дотримання наших юридичних зобов&quot;язань (наприклад,
        якщо ми зобов&quot;язані зберігати ваші дані для дотримання застосовних
        законів), вирішення спорів та забезпечення наших юридичних угод та
        політик.
      </Typography>
      <Typography variant='p'>
        Компанія також зберігатиме Дані Використання для внутрішнього аналізу.
        Дані Використання зазвичай зберігаються протягом коротшого періоду часу,
        за винятком випадків, коли ці дані використовуються для посилення
        безпеки або покращення функціональності Нашого Сервісу, або ми юридично
        зобов&quot;язані зберігати ці дані протягом довших періодів часу.
      </Typography>
      <Typography variant='h3'>Передача Ваших Персональних Даних</Typography>
      <Typography variant='p'>
        Ваша інформація, включаючи Персональні Дані, обробляється в операційних
        офісах Компанії та в будь-яких інших місцях, де знаходяться сторони,
        залучені до обробки. Це означає, що ця інформація може бути передана до
        - і зберігатися на - комп&quot;ютерах, розташованих за межами Вашого штату,
        провінції, країни або іншої урядової юрисдикції, де закони про захист
        даних можуть відрізнятися від тих, що діють у Вашій юрисдикції.
      </Typography>
      <Typography variant='p'>
        Ваша згода на цю Політику Конфіденційності, за якою слідує Ваше подання
        такої інформації, представляє Вашу згоду на таку передачу.
      </Typography>
      <Typography variant='p'>
        Компанія вживе всіх розумно необхідних заходів для забезпечення того,
        щоб з Вашими даними поводились безпечно та відповідно до цієї Політики
        Конфіденційності, і жодна передача Ваших Персональних Даних не
        відбудеться до організації або країни, якщо не буде адекватних засобів
        контролю, включаючи безпеку Ваших даних та іншої особистої інформації.
      </Typography>
      <Typography variant='h3'>Видалення Ваших Персональних Даних</Typography>
      <Typography variant='p'>
        Ви маєте право видалити або попросити Нас допомогти у видаленні
        Персональних Даних, які Ми зібрали про Вас.
      </Typography>
      <Typography variant='p'>
        Наш Сервіс може дати Вам можливість видалити певну інформацію про Вас з
        Сервісу.
      </Typography>
      <Typography variant='p'>
        Ви можете оновлювати, змінювати або видаляти свою інформацію в будь-який
        час, увійшовши до свого Облікового запису, якщо він у Вас є, і
        відвідавши розділ налаштувань облікового запису, який дозволяє Вам
        керувати своєю особистою інформацією. Ви також можете зв&quot;язатися з Нами,
        щоб запитати доступ, виправити або видалити будь-яку особисту
        інформацію, яку Ви надали Нам.
      </Typography>
      <Typography variant='p'>
        Зауважте, однак, що Нам може знадобитися зберегти певну інформацію, коли
        ми маємо юридичне зобов&quot;язання або законну підставу для цього.
      </Typography>
      <Typography variant='h3'>Розкриття Ваших Персональних Даних</Typography>
      <Typography variant='h4'>Бізнес-операції</Typography>
      <Typography variant='p'>
        Якщо Компанія бере участь у злитті, придбанні або продажу активів, Ваші
        Персональні Дані можуть бути передані. Ми повідомимо Вас перед тим, як
        Ваші Персональні Дані будуть передані і стануть предметом іншої Політики
        Конфіденційності.
      </Typography>
      <Typography variant='h4'>Правоохоронні органи</Typography>
      <Typography variant='p'>
        За певних обставин Компанія може бути зобов&quot;язана розкрити Ваші
        Персональні Дані, якщо це вимагається законом або у відповідь на дійсні
        запити державних органів (наприклад, суду або урядового агентства).
      </Typography>
      <Typography variant='h4'>Інші правові вимоги</Typography>
      <Typography variant='p'>
        Компанія може розкрити Ваші Персональні Дані, добросовісно вважаючи, що
        така дія необхідна для:
      </Typography>
      <List>
        <li>Дотримання юридичного зобов&quot;язання</li>
        <li>Захисту та захисту прав або власності Компанії</li>
        <li>
          Запобігання або розслідування можливих правопорушень у зв&quot;язку з
          Сервісом
        </li>
        <li>
          Захисту особистої безпеки Користувачів Сервісу або громадськості
        </li>
        <li>Захисту від юридичної відповідальності</li>
      </List>
      <Typography variant='h3'>Безпека Ваших Персональних Даних</Typography>
      <Typography variant='p'>
        Безпека Ваших Персональних Даних важлива для Нас, але пам&quot;ятайте, що
        жоден метод передачі через Інтернет або метод електронного зберігання не
        є 100% безпечним. Хоча Ми прагнемо використовувати комерційно прийнятні
        засоби для захисту Ваших Персональних Даних, Ми не можемо гарантувати їх
        абсолютну безпеку.
      </Typography>
      <Typography variant='h2'>Конфіденційність Дітей</Typography>
      <Typography variant='p'>
        Наш Сервіс не звертається до осіб віком до 13 років. Ми свідомо не
        збираємо особисту інформацію від осіб віком до 13 років. Якщо Ви є
        батьком або опікуном і Ви знаєте, що Ваша дитина надала Нам Персональні
        Дані, будь ласка, зв&quot;яжіться з Нами. Якщо Ми дізнаємося, що Ми зібрали
        Персональні Дані від будь-кого віком до 13 років без перевірки
        батьківської згоди, Ми вживаємо заходів для видалення цієї інформації з
        Наших серверів.
      </Typography>
      <Typography variant='p'>
        Якщо Нам потрібно покладатися на згоду як на юридичну основу для обробки
        Вашої інформації, і Ваша країна вимагає згоди від батьків, Ми можемо
        вимагати згоди Ваших батьків, перш ніж Ми збиратимемо та
        використовуватимемо цю інформацію.
      </Typography>
      <Typography variant='h2'>Посилання на Інші Веб-сайти</Typography>
      <Typography variant='p'>
        Наш Сервіс може містити посилання на інші веб-сайти, які не управляються
        Нами. Якщо Ви натиснете на посилання третьої сторони, Ви будете
        спрямовані на сайт цієї третьої сторони. Ми настійно рекомендуємо Вам
        переглянути Політику Конфіденційності кожного сайту, який Ви відвідуєте.
      </Typography>
      <Typography variant='p'>
        Ми не контролюємо і не несемо відповідальності за зміст, політику
        конфіденційності або практику будь-яких сайтів або послуг третіх сторін.
      </Typography>
      <Typography variant='h2'>
        Зміни до цієї Політики Конфіденційності
      </Typography>
      <Typography variant='p'>
        Ми можемо час від часу оновлювати нашу Політику Конфіденційності. Ми
        повідомимо Вас про будь-які зміни, розмістивши нову Політику
        Конфіденційності на цій сторінці.
      </Typography>
      <Typography variant='p'>
        Ми повідомимо Вам електронною поштою та/або помітним повідомленням на
        Нашому Сервісі перед тим, як зміна набере чинності, і оновимо дату
        &quot;Останнє оновлення&quot; у верхній частині цієї Політики
        Конфіденційності.
      </Typography>
      <Typography variant='p'>
        Вам рекомендується періодично переглядати цю Політику Конфіденційності
        на предмет будь-яких змін. Зміни до цієї Політики Конфіденційності
        набирають чинності, коли вони розміщені на цій сторінці.
      </Typography>
      <Typography variant='h2'>Зв&quot;яжіться з Нами</Typography>
      <Typography variant='p'>
        Якщо у Вас є будь-які питання щодо цієї Політики Конфіденційності, Ви
        можете зв&quot;язатися з нами:
      </Typography>
      <List>
        <li>За електронною поштою: vladyslav.mankivskyi@gmail.com</li>
      </List>
    </section>
  );
}
